In [2]:
import pandas as pd

In [4]:
df1 = pd.read_csv('./assets/marks2.csv', index_col=['Roll Numbers'])
df1.head()

              Math  Science  Eng         DOB
Roll Numbers
1               76       40   40   5/20/2000
2               44       45   45   5/21/2000
3               34       67   67   5/20/2000
4               76       23   23  11/20/2000
5                8       67   67   5/20/2000

In [7]:
df1.loc[2]

Math              44
Science           45
Eng               45
DOB        5/21/2000
Name: 2, dtype: object

In [8]:
df1.loc[1, 'Math']

np.int64(76)

In [9]:
df1.loc[1:8, 'Eng']

Roll Numbers
1    40
2    45
3    67
4    23
5    67
6    90
7    45
8    34
Name: Eng, dtype: int64

In [10]:
df1.loc[df1['Eng'] > 50] # all who scored 50 + in eng

              Math  Science  Eng        DOB
Roll Numbers
3               34       67   67  5/20/2000
5                8       67   67  5/20/2000
6               92       90   90  5/20/2000
9               76       11   55  5/20/2000
10              34       54   90  5/20/2000
13              37       67   55  5/20/2000
14              23       67   90  5/20/2000
15              86       37   67  5/20/2000
16              55       23   90  5/20/2000
19              86       46   55  5/20/2000
20              34       64   67  5/20/2000

In [11]:
df1.loc[df1['Eng'] > 70, ['Science']] # only science marks for them who score 70 + in eng

              Science
Roll Numbers
6                  90
10                 54
14                 67
16                 23

# iloc means the actual index that started from 0, but not user defined index weather defined or not

In [14]:
df1.iloc[2]

Math              34
Science           67
Eng               67
DOB        5/20/2000
Name: 3, dtype: object

In [15]:
df1.iloc[[3,4,5]]

              Math  Science  Eng         DOB
Roll Numbers
4               76       23   23  11/20/2000
5                8       67   67   5/20/2000
6               92       90   90   5/20/2000

In [16]:
df1.iloc[:, 1] # all the rows and second column

Roll Numbers
1     40
2     45
3     67
4     23
5     67
6     90
7      8
8     92
9     11
10    54
11    76
12    34
13    67
14    67
15    37
16    23
17    86
18    55
19    46
20    64
Name: Science, dtype: int64

In [23]:
df1.iloc[0:5, 1:3]

              Science  Eng
Roll Numbers
1                  40   40
2                  45   45
3                  67   67
4                  23   23
5                  67   67